
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>简介 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >简介</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x91D1;&#x5EB8;&#x5C0F;&#x8BF4;">&#x91D1;&#x5EB8;&#x5C0F;&#x8BF4;</h1>
<p>&#x91D1;&#x5EB8;&#x8BED;&#x8A00;&#x4E0D;&#x4EC5;&#x501F;&#x52A9;&#x767D;&#x63CF;&#x548C;&#x5FC3;&#x7406;&#x523B;&#x753B;&#xFF0C;&#x8FD8;&#x5E38;&#x968F;&#x5FC3;&#x6240;&#x6B32;&#x5730;&#x8FD0;&#x7528;&#x5404;&#x79CD;&#x4FEE;&#x9970;&#x624B;&#x6CD5;&#x3002;&#x8BB0;&#x5FC6;&#x72B9;&#x65B0;&#x7684;&#x662F;&#x300A;&#x96EA;&#x5C71;&#x98DE;&#x72D0;&#x300B;&#x4E2D;&#x63CF;&#x5199;&#x80E1;&#x4E00;&#x5200;&#x592B;&#x5987;&#x7684;&#x90A3;&#x53E5;&#x8BDD;&#xFF1A;&#x201C;&#x8FD9;&#x4E00;&#x7537;&#x4E00;&#x5973;&#x554A;&#xFF0C;&#x6253;&#x4E2A;&#x6BD4;&#x65B9;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x8C82;&#x8749;&#x5AC1;&#x7ED9;&#x4E86;&#x5F20;&#x98DE;&#x2026;&#x2026;&#x201D;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x4EBA;&#x7269;&#x5F62;&#x8C61;&#x501F;&#x52A9;&#x8BED;&#x8A00;&#x7684;&#x52FE;&#x52D2;&#x800C;&#x663E;&#x5F97;&#x5982;&#x9C7C;&#x5F97;&#x6C34;&#xFF0C;&#x5B83;&#x5524;&#x8D77;&#x7684;&#x60F3;&#x50CF;&#x4E0E;&#x8054;&#x60F3;&#x8BA9;&#x8BFB;&#x8005;&#x518D;&#x4E5F;&#x62B9;&#x4E0D;&#x53BB;&#x5BF9;&#x8FD9;&#x4E00;&#x5BF9;&#x592B;&#x59BB;&#x7684;&#x8BB0;&#x5FC6;&#x3002;&#x91D1;&#x5EB8;&#x7684;&#x8BED;&#x8A00;&#x8FD8;&#x5F88;&#x5E7D;&#x9ED8;&#x8BD9;&#x8C10;&#x3002;&#x4ECE;&#x201C;&#x8001;&#x987D;&#x7AE5;&#x201D;&#x5230;&#x201C;&#x6843;&#x8C37;&#x516D;&#x4ED9;&#x201D;&#x518D;&#x5230;&#x201C;&#x97E6;&#x5C0F;&#x5B9D;&#x201D;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EE4;&#x4EBA;&#x6367;&#x8179;&#x7684;&#x4EBA;&#x7269;&#x4F7F;&#x5F97;&#x5C0F;&#x8BF4;&#x6B64;&#x8D77;&#x5F7C;&#x4F0F;&#xFF0C;&#x6709;&#x6ECB;&#x6709;&#x5473;&#x3002;&#x4ED6;&#x4EEC;&#x6216;&#x662F;&#x6210;&#x4E3A;&#x4E00;&#x79CD;&#x610F;&#x4E49;&#x6216;&#x601D;&#x7EF4;&#x7684;&#x5316;&#x8EAB;&#xFF0C;&#x6216;&#x662F;&#x6210;&#x4E3A;&#x5C0F;&#x8BF4;&#x91CD;&#x8981;&#x60C5;&#x8282;&#x6216;&#x7EBF;&#x7D22;&#x5145;&#x5B9E;&#x5C0F;&#x8BF4;&#x5185;&#x5BB9;&#xFF0C;&#x6216;&#x662F;&#x4E0E;&#x53D9;&#x4E8B;&#x89D2;&#x5EA6;&#x548C;&#x8BC4;&#x70B9;&#x76F8;&#x7ED3;&#x5408;&#xFF0C;&#x4E0D;&#x4F46;&#x4E3A;&#x91D1;&#x5EB8;&#x5C0F;&#x8BF4;&#x5438;&#x5F15;&#x4E86;&#x65E0;&#x6570;&#x7684;&#x8BFB;&#x8005;&#xFF0C;&#x4E5F;&#x4E3A;&#x8FD9;&#x4E2A;&#x5FEB;&#x8282;&#x594F;&#x7684;&#x4E16;&#x754C;&#x6CE8;&#x5165;&#x4E86;&#x4E00;&#x80A1;&#x6D3B;&#x529B;&#x3002;&#x5728;&#x6545;&#x4E8B;&#x521B;&#x4F5C;&#x4E2D;&#xFF0C;&#x51E0;&#x4E2A;&#x4E8B;&#x4EF6;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x53D1;&#x751F;&#xFF0C;&#x4F46;&#x662F;&#x8BDD;&#x8BED;&#x5374;&#x5FC5;&#x987B;&#x628A;&#x5B83;&#x4EEC;&#x4E00;&#x4EF6;&#x4E00;&#x4EF6;&#x5730;&#x53D9;&#x8FF0;&#x51FA;&#x6765;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x300A;&#x5929;&#x9F99;&#x516B;&#x90E8;&#x300B;&#x8FD9;&#x4E48;&#x4E00;&#x90E8;&#x6C14;&#x52BF;&#x6062;&#x5B8F;&#x3001;&#x591A;&#x5934;&#x5E76;&#x8FDB;&#x7684;&#x4F5C;&#x54C1;&#x4E5F;&#x5F97;&#x5982;&#x6B64;&#x3002;&#x8FD9;&#x5C31;&#x8981;&#x63D0;&#x53CA;&#x8BED;&#x5F0F;&#x4E2D;&#x7684;&#x8BB2;&#x8FF0;&#x4E0E;&#x63CF;&#x8FF0;&#x3002;&#x8BB2;&#x8FF0;&#x4E0E;&#x63CF;&#x8FF0;&#x7684;&#x533A;&#x522B;&#x4F53;&#x73B0;&#x5728;&#x53D9;&#x4E8B;&#x89D2;&#x5EA6;&#x3001;&#x4EBA;&#x79F0;&#x8F6C;&#x6362;&#x3001;&#x53D9;&#x4E8B;&#x4E0E;&#x6545;&#x4E8B;&#x7684;&#x8DDD;&#x79BB;&#x4EE5;&#x53CA;&#x53D9;&#x4E8B;&#x6001;&#x5EA6;&#x4E0A;&#xFF0C;&#x201C;&#x8BB2;&#x8FF0;&#x662F;&#x5386;&#x65F6;&#x6027;&#x7684;&#x53D9;&#x8FF0;&#xFF0C;&#x63D0;&#x4F9B;&#x6545;&#x4E8B;&#x7684;&#x6765;&#x9F99;&#x53BB;&#x8109;&#xFF0C;&#x4EA4;&#x4EE3;&#x4EBA;&#x7269;&#x7684;&#x8FC7;&#x53BB;&#x4EE5;&#x53CA;&#x6709;&#x5173;&#x4FE1;&#x606F;&#x201D;&#xFF1B;&#x800C;&#x63CF;&#x8FF0;&#x5219;&#x201C;&#x6BD4;&#x8F83;&#x542B;&#x84C4;&#xFF0C;&#x591A;&#x7528;&#x5BA2;&#x89C2;&#x6216;&#x2018;&#x4E2D;&#x6027;&#x2019;&#x7684;&#x8BED;&#x8C03;&#x201D;&#xFF0C;&#x662F;&#x201C;&#x7ED9;&#x5B9A;&#x4E86;&#x573A;&#x9762;&#x7684;&#x620F;&#x5267;&#x6027;&#x7684;&#x73B0;&#x65F6;&#x6027;&#x7684;&#x53D9;&#x8FF0;&#x578B;&#x8BED;&#x5F0F;&#x201D;&#x2467;&#x3002;&#x8BB2;&#x8FF0;&#x4E0E;&#x63CF;&#x8FF0;&#x7684;&#x7075;&#x6D3B;&#x8FD0;&#x7528;&#x5728;&#x91D1;&#x5EB8;&#x5C0F;&#x8BF4;&#x4E2D;&#x968F;&#x5904;&#x53EF;&#x89C1;&#xFF0C;&#x5982;&#x300A;&#x501A;&#x5929;&#x5C60;&#x9F99;&#x8BB0;&#x300B;&#x7B2C;&#x4E8C;&#x7AE0;&#x300A;&#x6B66;&#x5F53;&#x5C71;&#x9876;&#x677E;&#x67CF;&#x957F;&#x300B;&#x7684;&#x6700;&#x540E;&#x4E00;&#x6BB5;&#x5199;&#x9053;&#xFF1A;&#x201C;&#x5F20;&#x541B;&#x5B9D;&#x5176;&#x65F6;&#x5E74;&#x5C81;&#x5C1A;&#x8F7B;&#xFF0C;&#x4E5F;&#x4E0D;&#x6562;&#x65AD;&#x5B9A;&#x81EA;&#x5DF1;&#x7684;&#x63A8;&#x6D4B;&#x5FC5;&#x5BF9;&#x3002;&#x4ED6;&#x5F97;&#x89C9;&#x8FDC;&#x4F20;&#x6388;&#x751A;&#x4E45;&#xFF0C;&#x4E8E;&#x8FD9;&#x90E8;&#x4E5D;&#x9633;&#x771F;&#x7ECF;&#x5DF2;&#x8BB0;&#x4E86;&#x5341;&#x4E4B;&#x4E94;&#x516D;&#xFF0C;&#x5341;&#x4F59;&#x5E74;&#x95F4;&#x7ADF;&#x7136;&#x5185;&#x529B;&#x5927;&#x8FDB;&#xFF0C;&#x5176;&#x540E;&#x591A;&#x8BFB;&#x9053;&#x85CF;&#xFF0C;&#x4E8E;&#x9053;&#x5BB6;&#x7EC3;&#x6C14;&#x4E4B;&#x672F;&#x66F4;&#x6DF1;&#x6709;&#x5FC3;&#x5F97;&#x3002;&#x67D0;&#x4E00;&#x65E5;&#x5728;&#x5C71;&#x95F4;&#x95F2;&#x6E38;&#xFF0C;&#x4EF0;&#x671B;&#x6D6E;&#x4E91;&#xFF0C;&#x4FEF;&#x89C6;&#x6D41;&#x6C34;&#xFF0C;&#x5F20;&#x541B;&#x5B9D;&#x82E5;&#x6709;&#x6240;&#x609F;&#xFF0C;&#x5728;&#x6D1E;&#x4E2D;&#x82E6;&#x601D;&#x4E03;&#x65E5;&#x4E03;&#x591C;&#xFF0C;&#x731B;&#x5730;&#x91CC;&#x8C41;&#x7136;&#x8D2F;&#x901A;&#xFF0C;&#x9886;&#x4F1A;&#x4E86;&#x6B66;&#x529F;&#x4E2D;&#x4EE5;&#x67D4;&#x514B;&#x521A;&#x7684;&#x81F3;&#x7406;&#xFF0C;&#x5FCD;&#x4E0D;&#x4F4F;&#x4EF0;&#x5929;&#x957F;&#x7B11;&#x3002;&#x201D;&#x8FD9;&#x662F;&#x63CF;&#x8FF0;&#x6027;&#x7684;&#xFF0C;&#x540E;&#x9762;&#x53C8;&#x63A5;&#x7740;&#x9053;&#xFF1A;&#x201C;&#x8FD9;&#x4E00;&#x756A;&#x5927;&#x7B11;&#xFF0C;&#x7ADF;&#x7B11;&#x51FA;&#x4E86;&#x4E00;&#x4F4D;&#x627F;&#x5148;&#x542F;&#x540E;&#x3001;&#x7EE7;&#x5F80;&#x5F00;&#x6765;&#x7684;&#x5927;&#x5B97;&#x5E08;&#x3002;&#x4ED6;&#x4EE5;&#x81EA;&#x609F;&#x7684;&#x62F3;&#x7406;&#x3001;&#x9053;&#x5BB6;&#x51B2;&#x865A;&#x5706;&#x901A;&#x4E4B;&#x9053;&#x548C;&#x4E5D;&#x9633;&#x771F;&#x7ECF;&#x4E2D;&#x6240;&#x8F7D;&#x7684;&#x5185;&#x529F;&#x76F8;&#x53D1;&#x660E;&#xFF0C;&#x521B;&#x51FA;&#x4E86;&#x8F89;&#x6620;&#x540E;&#x4E16;&#x3001;&#x7167;&#x8000;&#x5343;&#x53E4;&#x7684;&#x6B66;&#x5F53;&#x4E00;&#x6D3E;&#x6B66;&#x529F;&#x3002;&#x540E;&#x6765;&#x5317;&#x6E38;&#x5B9D;&#x9E23;&#xFF0C;&#x89C1;&#x5230;&#x4E09;&#x5CF0;&#x633A;&#x79C0;&#xFF0C;&#x5353;&#x7ACB;&#x4E91;&#x6D77;&#xFF0C;&#x4E8E;&#x6B66;&#x5B66;&#x53C8;&#x6709;&#x6240;&#x609F;&#xFF0C;&#x4E43;&#x81EA;&#x53F7;&#x4E09;&#x4E30;&#xFF0C;&#x90A3;&#x4FBF;&#x662F;&#x4E2D;&#x56FD;&#x6B66;&#x5B66;&#x53F2;&#x4E0A;&#x4E0D;&#x4E16;&#x51FA;&#x7684;&#x5947;&#x4EBA;&#x5F20;&#x4E09;&#x4E30;&#x3002;&#x201D;&#x8FD9;&#x53C8;&#x662F;&#x8BB2;&#x8FF0;&#x4E86;&#x3002;&#x5728;&#x8FD9;&#x6BB5;&#x8BDD;&#x91CC;&#xFF0C;&#x63CF;&#x8FF0;&#x8F6C;&#x6362;&#x6210;&#x8BB2;&#x8FF0;&#x662F;&#x4E0D;&#x7740;&#x75D5;&#x8FF9;&#x7684;&#xFF0C;&#x7EC6;&#x5FC3;&#x7684;&#x8BFB;&#x8005;&#x5728;&#x9605;&#x8BFB;&#x300A;&#x8881;&#x5D07;&#x7115;&#x8BC4;&#x4F20;&#x300B;&#x65F6;&#x80AF;&#x5B9A;&#x66F4;&#x4F1A;&#x6709;&#x8FD9;&#x79CD;&#x611F;&#x89C9;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"简介","level":"1.1","depth":1,"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"README.md","mtime":"2020-02-27T04:20:53.444Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-02-27T04:44:55.708Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

